questions_PB_budget = [
        # 1
        'По какой причине можно подать заявление бюджетнику в профбюро интситута?',

        # 2
        'Где находится профбюро?',

        # 3
        'Как подать заявление в профбюро интситута?',

        # 4
        'За покупку какой одежды можно подать заявление в профбюро?',

        # 5
        'На какую выплату я могу рассчитывать в профбюро института?',

        # 6
        'Когда ожидать выплату?',

        # 7
        'Что делать, если не пришла материальная помощь?',

        # 8
        'Почему пришла не вся сумма?',

        # 9
        'Нужно ли вступать в профсоюз, чтобы подать на материальную помощь?',

        # 10
        'Сколько действуют чеки и билеты?'
    ]

answers_PB_budget = [
        # 1
        'ответ картинкой reasons_for_applying_for_material_help_pb_budget',

        # 2
        'ответ картинкой pb_adress',

        # 3
        'Для подачи требуется собрать необходимые документы, написать заявление '
        'и принести его в рабочее время комиссий. Найти эту информацию можно в группе Союза студентов вашего института',

        # 4
        'Можно подать чек за демисезонную и зимнюю верхнюю одежду (куртка, пальто, пуховик и т.п) '
        'и обувь (ботинки, ботильоны, сапоги), но нельзя за кроссовки и кеды. Не принимаются также '
        'чеки за шапки, шарфы, джинсы, кофты, только верхняя одежда!',

        # 5
        'Выплаты в институтах до 7000 рублей. Размер выплаты зависит от причины подачи, '
        'расходов в заявлении и определяется решением комиссии.',

        # 6
        'В профбюро заявления принимаются до 1 числа месяца '
        'и тогда выплата назначается в этом же месяце.\n'
        '\n'
        'Например, вы подали заявление 28 октября, тогда выплата будет в ноябре '
        'и придет вместе со стипендией. А вот если подали заявление 4 ноября, то выплату нужно ждать уже в декабре.',

        # 7
        'Иногда стипендия и материальная помощь приходят разными платежами и нужно подождать. '
        'В целом выплаты приходят до 5 числа следующего месяца, но если и после этого выплаты не было, '
        'то следует написать заместителю по социально-правовой работе в вашем институте '
        '(контакты можно найти в группе Союза студентов института) и узнать, назначена ли материальная помощь.\n'
        '\n'
        'Если выплата назначена, но вам на карту не поступила, нужно обратиться в Стипендиальный отдел (аудитория М-230а) и уточнить причину.',

        # 8
        'Материальная помощь – частичная компенсация затрат, и размер выплат зависит от ваших расходов '
        'и фонда материальной помощи, который был выделен на месяц.',

        # 9
        'Нет, для того, чтобы получить материальную помощь, вступать в профсоюз не требуется.',

        # 10
        'Подать чеки за одежду и лечение и билеты за проезд до дома можно подать до конца учебного года. \n'
        '\n'
        'И еще важный момент: у первокурсников чеки и билеты могут быть от 20 августа и позднее, '
        'а вот у старших курсов от 1 сентября и позднее. Более ранние чеки и билеты не принимаются.'
    ]

questions_POS_budget = [
        # 1
        'По какой причине можно подать заявление бюджетнику в ГУК-309?',

        # 2
        'Когда можно подать заявление бюджетнику в ГУК-309?',

        # 3
        'Можно ли подать заявление за покупку одежды, если чек больше 7000 рублей?',

        # 4
        'Могу ли я подать заявление за поездку на научную конференцию?',

        # 5
        'Можно ли подать за стоматологическое или офтальмологическое лечение?',

        # 6
        'Как подать заявление по причине съема жилья?',

        # 7
        'На какую выплату я могу рассчитывать в ГУК-309?',

        # 8
        'Когда ожидать выплату, если подпвал в ГУК-309?',

        # 9
        'Что делать, если не пришла материальная помощь из ГУК-309?',

        # 10
        #'Почему пришла не вся сумма?',

        # 11
        #'Нужно ли вступать в профсоюз, чтобы подать на материальную помощь?',

        # 12
        #'Сколько действуют чеки и билеты?'
    ]

answers_POS_budget = [
        # 1
        'ответ картинкой reasons_for_applying_for_material_help_pos_budget',

        # 2
        'Заявления принимаются по будням в ГУК-309 с 12:00 до 16:00',

        # 3
        'Нет, нельзя, заявления по причине покупки сезонной одежды у студентов-бюджетников принимаются только в профбюро института',

        # 4
        'Нет, фонд материальной поддержки на это не рассчитан. Мы можем посоветовать попробовать обратиться '
        'в [Отдел молодежной науки](https://youthscience.urfu.ru/ru/kontakty/) или в институт на кафедру или в деканат.',

        # 5
        f'Можно подать заявление за стоматологическое лечение, пройденное в МСЧ УрФУ, чеки из других клиник не принимаются. \n'
        f'\n'
        f'Можно подать заявление за офтальмологическое лечение, которое не было направлено на коррекцию зрения. '
        f'Чеки за процедуры/операции по коррекции зрения, чеки за покупку очков и линз не принимаются.',

        # 6
        'Нет, с этого года заявления по этой причине непоселения в общежитие не принимаются. '
        'На данный момент Университет полностью обеспечен местами для проживания студентов.',

        # 7
        'В целом выплаты составляют до 20 000 рублей. Размер выплаты зависит от причины подачи, '
        'расходов в заявлении и определяется решением комиссии',

        # 8
        f'В ГУК-309 заявления принимаются до 10 числа месяца и тогда выплата назначается в этом же месяце. \n'
        f'\n'
        f'Например, вы подали заявление 8 ноября, тогда выплата будет в ноябре и придет вместе со стипендией. '
        f'А вот если подали заявление 13 ноября, то выплату нужно ждать уже в декабре.',

        # 9
        'Иногда стипендия и материальная помощь приходят разными платежами и нужно подождать. '
        'В целом выплаты приходят до 5 числа следующего месяца, но если и после этого выплаты не было, '
        'то можно написать в группу Союза студентов УрФУ или лично прийти в ГУК-309 и узнать, '
        'назначена ли материальная помощь. \n'
        'Если выплата назначена, но вам на карту не поступила, '
        'нужно обратиться в Стипендиальный отдел (аудитория М-230а) и уточнить причину. \n'
        '\n'
        'Номер Стипендиального отдела: +7(343) 375-41-09',

        # 10
        'Материальная помощь – частичная компенсация затрат, '
        'и размер выплат зависит от ваших расходов и фонда материальной помощи, '
        'который был выделен на месяц',

        # 11
        'Нет, для того, чтобы получить материальную помощь, вступать в профсоюз не требуется.',

        # 12
        f'Подать чеки за одежду и лечение и билеты за проезд до дома можно подать до конца учебного года.\n'
        f'\n'
        f'И еще важный момент: у первокурсников чеки и билеты могут быть от 20 августа и позднее, '
        f'а вот у старших курсов от 1 сентября и позднее. Более ранние чеки и билеты не принимаются.'
    ]


questions_POS_contract = [
        # 1
        'По какой причине можно подать заявление контрактнику в ГУК-309?',

        # 2
        'Когда можно подать заявление контракнику в ГУК-309?',

        # 3
        'Как подать заявление контракнику в ГУК-309?',

        # 4
        'За покупку какой одежды можно подать заявление в ГУК-309?',

        # 5
        'Сколько раз можно подавать заявление?',

        # 6
        'Когда приходит материальная помощь?',

        # 7
        'Почему пришло так мало?'
    ]


answers_POS_contract = [
        # 1
        'ответ картинкой reasons_for_applying_for_material_help_contract',

        # 2
        'Заявления принимаются по будням в ГУК-309 с 12:00 до 16:00 или на Ленина, 51, аудитория 119 '
        '(дни и время для приема заявления уточнять в группе Союза студентов УГИ)',

        # 3
        f'Помимо подтверждающих документов и заявления требуется принести полные реквизиты '
        f'для перевода средств и наличие продленного профсоюзного билета. \n'
        f'\n'
        f'Для того, чтобы продлить профсоюзный билет или вступить в профсоюз, '
        f'следует написать ответственному в институте и уточнить всю необходимую информацию.\n'
        f'\n'
        f'Заявление будет принято, если на момент подачи имеется две отметки о продлении, '
        f'то есть оплаченный год.',

        # 4
        'Можно подать чек за демисезонную и зимнюю верхнюю одежду '
        '(куртка, пальто, пуховик и т.п) и обувь (ботинки, ботильоны, сапоги), '
        'но нельзя за кроссовки и кеды. Не принимаются также чеки за шапки, '
        'шарфы, джинсы, кофты, только верхняя одежда!',

        # 5
        'Заявление принимается один раз в учебном году',

        # 6
        'Заявления принимаются до 10 числа месяца, а сама выплата приходит до конца месяца.',

        # 7
        'Студенты-контрактники получают материальную помощь из средств Профсоюза, '
        'а студенты, обучающиеся на бюджете из средств Стипендиального фонда. '
        'По этой причине для студентов-контрактников на весь период обучения выделено 10 000 рублей. '
        'Исходя из этого и определяется размер выплат.'
    ]