questions_scolarship = [
    # 1
    'Государственная академическая стипендия',

    # 2
    'Повышенная государственная академическая стипендия',

    # 3
    #'Государственная социальная стипендия',

    # 4
    #'Размер социальной стипендии',

    # 5
    'Стипендия талантливым первокурсникам',

    # 6
    'Именные стипендии'
]


answers_scolarship = [
    # 1
    'Назначается по результатам сессии:\n'
    '\n'
    '— с 1 февраля по 30 июня т.г. – по итогам зимней сессии;\n'
    '— с 1 июля по 31 января т.г. – по итогам летней сессии;\n'
    '— при отсутствии оценок «удовлетворительно» и академической задолженности.\n'
    '\n'
    'Подробнее о получении каждой стипендии можно узнать на [сайте](https://urfu.ru/ru/students/study/scholarships/).',

    # 2
    'ответ картинкой hight_gos_scolarhip',

    # 3
    #'Государственная социальная стипендия',

    # 4
    #'2985,8 руб. – базовый размер социальной стипендии.\n'
    #'6585 руб. – повышенная государственная социальная стипендия.\n'
    #'\\*без учета районного коэффициента.\n'
    #'\n'
    #'Повышенная государственная социальная стипендия назначается студентам 1 и 2 курса, '
    #'имеющим оценки успеваемости «отлично», «хорошо», «хорошо» и «отлично».',

    # 5
    '— составляет 10 000, 20 000, 30 000 рублей в зависимости '
    'от достижений первокурсника и назначается при зачислении; \n'
    '— продлевается на второй семестр, если доля оценок “хорошо” в зимнюю сессию составит не более 35%.',

    # 6
    'Университет предоставляет множество возможностей для стимулирования студентов, '
    'имеющих успехи в учебной, научной, творческой, спортивной и общественной деятельности '
    'и реализует ряд программ, которые этому способствуют.\n'
    '\n'
    'Ознакомиться с условиями получения именных стипендий можно на [сайте](https://urfu.ru/ru/students/study/scholarships/) '
]