questions_Student_union_opportunities = [
        # вопрос 1
        #'Другие плюшки',

        # вопрос 2
        'Нуждаетесь в юридической консультации или не знаете, куда обратиться с проблемой',

        # вопрос 3
        'Нуждаетесь в материальной поддержке',

        # вопрос 4
        'Хотите изучать иностранные языки',

        # вопрос 5
        'Хотите воспользоваться бесплатным завтраком от Союза студентов',

        # вопрос 6
        'Обучаетесь на контрактной основе и хотите получить скидку на обучение',

        # вопрос 7
        'Любите спорт или увлекаетесь творчеством',

        # вопрос 8
        'Хотите попробовать себя в роли наставника',

        # вопрос 9
        'Хотите реализовать свою инициативу',

        # вопрос 10
        'Хотите путешествовать',

        # вопрос 11
        'Любите науч-поп или читать книги',

        # вопрос 12
        'Хотите познакомиться с самыми крупными и яркими мероприятиями университета',

        'Другие плюшки'
    ]

answers_Student_union_opportunities = [
        #1 [<Ваш текст>](<Ссылка>)
        #'Департамент Союза студентов по работе со студенческими корпусами представляет права и интересы всех обучающихся, '
        #'проживающих в общежитиях. Также, решает социально-бытовые (и не только) вопросы, '
        #'создает условия для досуговой деятельности и развития творчества, повышения социальной активности студентов.\n'
        #'\n'
        #'В состав департамента входят Объединенный совет студенческого городка (ОССГ) и команды Советов студенческих корпусов (ССК). '
        #'Крупные мероприятие департамента: ежегодное поселение студентов в студенческие корпуса, '
        #'поселение участников проекта [«Тест-драйв в Уральском федеральном»](https://vk.com/test_draive_v_urfu) '
        #'студенческий образовательный проект [«Школа ОССГ»](https://vk.com/school_ossg) '
        #'студенческий проект «Слет актива ОССГ» и многое другое.\n'
        #'\n'
        #'Союз студентов занимается поселением семейных студентов, которые являются гражданами РФ '
        #'и ближнего зарубежья. Более подробную информацию о заселении можно узнать [здесь](https://vk.com/familyurfu). '
        #'Также членам профсоюза с детьми Союз студентов дарит новогодние подарки. '
        #'Для тех, кто не живет в общежитии, но находится в поисках жилья, '
        #'в Союзе студентов работает проектный офис «Платное жилье». Это сервис комплексного решения '
        #'жилищных вопросов обучающихся. За время своего существования '
        #'с 2011 года специалисты заселили более 5 000 студентов.\n'
        #'\n'
        #'На сегодняшний день «Платное жилье» предлагает поиск квартир и комнат для найма, размещение в частных студенческих общежитиях или в хостелах-партнерах.\n'
        #'\n'
        #'Проектный офис «Платное Жильё» - Зверев Михаил Вячеславович (+7 (999) 559-61-12, mail@studentrealty.ru)\n'
        #'\n'
        #'[Подробнее о работе сервиса](https://vk.com/rent_flats',


        # 2
        f'Для членов профсоюза Союз студентов УрФУ осуществляет бесплатные юридические консультации '
        f'по любым вопросам, связанным с законодательством РФ. Чтобы получить консультацию, '
        f'переходите по [ссылке](https://vk.cc/87K7fn). \n'
        f'\n'
        f'Сервис Союза студентов «Красная кнопка» позволяет каждому члену профсоюза сообщить о проблемах, '
        f'связанных с организацией питания, организацией учебной деятельности, качеством образования, '
        f'работой учебной части, условиями проживания в студенческих общежитиях, '
        f'а также с иными правовыми вопросами в рамках университета.\n'
        f'\n'
        f'[Сообщить о проблеме или предложить инициативу](https://vk.cc/89bXtd).',

        # 3
        f'У каждого студента вне зависимости от формы обучения есть возможность вернуть деньги  '
        f'за расходы определенных категорий, к примеру оплата дорогостоящего лечения '
        f'или покупка дорогостоящей демисезонной одежды. '
        f'Вся подробная информация о материальной помощи есть [здесь](https://vk.cc/c4kCib). '
        f'\n'
        f'Заявления на материальную помощь принимаются в профбюро институтов '
        f'или в ГУК-309 (офис Союза студентов УрФУ) в рабочее время. ',


        #4
        f'Клуб иностранных языков (КИЯ) – невозможность изучения иностранного языка '
        f'с носителем в супер комфортной атмосфере. Занятие проходят в группах, '
        f'в качестве преподавателей – иностранные студенты, носители языка. На выбор есть 12 языков, '
        f'можно присоединиться к группам разного уровня, от начинающих до профи.\n'
        f'[Узнать подробнее](https://vk.com/club_urfu).',


        # 5
        f'Бесплатный завтрак для членов профсоюза – возможность всем членам профсоюза '
        f'бесплатно позавтракать в университетской столовой с 8:00 до 11:00. '
        f'На выбор в меню два вида завтраков: каша + булочка или каша + яблоко. '
        f'Чтобы воспользоваться сервисом, необходимо:\n'
        f'\n'
        f'1. Подписаться на группу [Питание и здоровье в УрФУ](https://vk.com/eda_urfu)\n'
        f'2. Оставить [заявку](https://vk.cc/8FyCuP) через виджет группы\n'
        f'3. Указать в заявке номер электронного профсоюзника\n'
        f'4. Подождать, пока администратор пришлет код (заявка обрабатывается в течение 24 часов)\n'
        f'А затем прийти в одну из указанных в виджете столовых и наслаждаться!',


        # 6
        f'Запоминайте комбинацию: вы студент-контрактник '
        f'+ входите в топ-10 рейтинга внеучебной деятельности '
        f'+ у вас не было академических задолженностей и удовлетворительных отметок на протяжении всего периода обучения '
        f'= Союз студентов договорился о предоставлении вам скидки на обучение в размере 20 %.\n'
        f'\n'
        f'Дерзайте!',


        # 7
        f'Департамент по спортивно-массовой работе занимается организацией досуга '
        f'для студентов благодаря спортивным мероприятиям. Сотрудники познакомят '
        f'со спортом в УрФУ и при необходимости помогут с решением трудностей, связанных '
        f'с этой сферой. Совместно с другими организациями департамент проводит спортивные фестивали и универсиады.\n'
        f'По всем вопросам можно обращаться к [Мише Тиунову](https://vk.com/m.tiunov14)\n'
        f'\n'
        f'Культурно-массовый департамент занимается развитием творческого потенциала студентов. '
        f'Раскрыть буквально все способности, от вокальных до художественных, помогают проекты, '
        f'реализованные совместно с Центром творчества. «Дебют первокурсника» направлен на адаптацию студентов, '
        f'«Бенефис» – помогает сдружить институты и реализовать творческие способности в полной мере и др.\n'
        f'По всем вопросам можно обращаться к [Лере Рублевой](https://vk.com/18valera_ru)',


        # 8
        f'Вам в Ассоциацию студентов-наставников (АСН) Союза студентов. '
        f'Основные цели организации: адаптация студентов-первокурсников к образовательному процессу, '
        f'удовлетворение потребностей в интеллектуальном, культурном, нравственном развитии, '
        f'повышение социальной активности, уровня культуры студентов, '
        f'повышение интереса к образовательному процессу и карьерному развитию.'
        f'\n'
        f'Крупные проекты: центр компетенций «Федерация наставничества», форум наставничества.\n'
        f'[Больше информации здесь](https://vk.com/asn_urfu).',


        # 9
        f'Направление развития социальной активности занимается помощью студентам '
        f'в реализации своих идей и развитии себя в рамках университета. В направление входит '
        f'департамент развития студенческого потенциала, который реализует различные проекты, '
        f'инициируемые как студенческими организациями, так и обычными студентами.'
        f'\n'
        f'Если у вас есть идея мероприятия или вам чего-то не хватает в университете, '
        f'направление поможет воплотить все удивительные идеи. Департамент занимается помощью '
        f'не только в организации мероприятий, но и привлекает финансирование на крупные проекты '
        f'студенческих организаций. Так, за прошедшее время работы, департаментом было написано '
        f'и выиграно множество грантов на общую сумму 5 137 000 рублей.'
        f'\n'
        f'Предложить свою идею можно в [личные сообщения группы](https://vk.com/club215921890).',


        # 10
        f'Союз студентов нередко организует поездки в разные города России для участников своих '
        f'мероприятий или победителей конкурсов. К примеру, за последний год активисты посетили Калининград, '
        f'Москву, Питер, Казань, Тюмень, Крым, Пятигорск, Челябинск и другие города.\n'
        f'\n'
        f'А для лидеров рейтинга внеучебной деятельности есть специальное летнее '
        f'предложение – оздоровительный отдых в Туапсе, на берегу Черного моря.\n'
        f'\n'
        f'Помимо организации досуга в путешествии, Союз студентов совместно '
        f'с администрацией вуза частично возмещает стоимость билетов.\n'
        f'\n'
        f'Вливайтесь во внеучебную жизнь, участвуйте в мероприятиях и, возможно, в следующую поездку отправитесь вы.',


        # 11
        f'Учебно-научный департамент Союза студентов организует мероприятия '
        f'для самых умных или тех, кто хочет ими стать (при этом в интересном и веселом формате). '
        f'Вот самые крупные проекты:\n'
        f'«Инженерные соревнования» - для студентов технических специальностей и не только.\n'
        f'[«Литературный клуб»](https://t.me/litcluburfu) – действующий разговорный клуб студентов, увлекающихся чтением и литературой.\n'
        f'«Самый умный первокурсник» – ежегодные интеллектуальные соревнования первокурсников университета.',


        # 12
        f'Их реализует проектное направление Союза студентов УрФУ. Вот маст визит мероприятия каждого студента:\n'
        f'[«День первый в Уральском федеральном»](https://vk.com/thefirstdayurfu): первый и самый важный праздник для первокурсников университета.\n'
        f'\n'
        f'[«Ежегодная премия Студент года УрФУ»](https://vk.com/student_goda_urfu) – проект Союза студентов, который позволяет выявить лучших среди первых. Студенты могут принять участие в 12 номинациях. В рамках премии студенты создают свои проекты, организовывают добровольческие акции, повышают уровень soft-skills. Завершается проект красочной и масштабной церемонией награждения.\n'
        f'\n'
        f'[«Хоровод УрФУ»](https://vk.com/birthdayurfu) – празднование дня рождения университета, ежегодно проходит 19 октября. Во время самого длинного перерыва между парами – большака – сотни студентов поздравляют УрФУ с днем рождения, водят хоровод и кушают самый вкусный торт.\n'
        f'\n'
        f'[«Лица Уральского федерального»](https://vk.com/facesurfu) – единственное официальное посвящение первокурсников, тусовка на самой большой концертной площадке Екатеринбурга с крутыми диджеями, красивыми фотозонами, розыгрышами призов и той самой атмосферой только начавшегося студенчества.\n'
        f'\n'
        f'[«Майский слет»](https://vk.com/newmayskiy23) – всеми любимый 3-х дневный весенний слет самых активных членов профсоюза (Союза студентов УрФУ) на базе отдыха вблизи города Екатеринбурга.\n'
        f'\n'
        f'[«RaZOOM»](https://vk.com/razoom_urfu) – образовательный проект про саморазвитие. Поток проекта = серия лекций на самые разные темы: от публичных выступлений и командообразования до онлайн-маркетинга и SMM.\n'
        f'\n'
        f'Следите за новостями [Союза студентов УрФУ](https://vk.com/posnews). ',

#1 [<Ваш текст>](<Ссылка>)
        'Департамент Союза студентов по работе со студенческими корпусами представляет права и интересы всех обучающихся, '
        'проживающих в общежитиях. Также, решает социально-бытовые (и не только) вопросы, '
        'создает условия для досуговой деятельности и развития творчества, повышения социальной активности студентов.\n'
        '\n'
        'В состав департамента входят Объединенный совет студенческого городка (ОССГ) и команды Советов студенческих корпусов (ССК). '
        'Крупные мероприятие департамента: ежегодное поселение студентов в студенческие корпуса, '
        'поселение участников проекта [«Тест-драйв в Уральском федеральном»](https://vk.com/test_draive_v_urfu) '
        'студенческий образовательный проект [«Школа ОССГ»](https://vk.com/school_ossg) '
        'студенческий проект «Слет актива ОССГ» и многое другое.\n'
        '\n'
        'Союз студентов занимается поселением семейных студентов, которые являются гражданами РФ '
        'и ближнего зарубежья. Более подробную информацию о заселении можно узнать [здесь](https://vk.com/familyurfu). '
        'Также членам профсоюза с детьми Союз студентов дарит новогодние подарки. '
        'Для тех, кто не живет в общежитии, но находится в поисках жилья, '
        'в Союзе студентов работает проектный офис «Платное жилье». Это сервис комплексного решения '
        'жилищных вопросов обучающихся. За время своего существования '
        'с 2011 года специалисты заселили более 5 000 студентов.\n'
        '\n'
        'На сегодняшний день «Платное жилье» предлагает поиск квартир и комнат для найма, размещение в частных студенческих общежитиях или в хостелах-партнерах.\n'
        '\n'
        'Проектный офис «Платное Жильё» - Зверев Михаил Вячеславович (+7 (999) 559-61-12, mail@studentrealty.ru)\n'
        '\n'
        '[Подробнее о работе сервиса](https://vk.com/rent_flats'

    ]
